apps/rails2/redmine-1.1.1/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0" dumptraffic="false">
  <!-- Client side setup -->
  <clients>
    <client host="localhost" cpu="2" />
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="server" port="8080" type="tcp"></server>
  </servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
       agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="server" type="erlang"></monitor>
  </monitoring>

  <load>
    <!-- several arrival phases can be set: for each phase, you can set
         the mean inter-arrival time between new clients and the phase
         duration -->
    <user session="ensureproject" start_time="0" unit="second"></user>

    <arrivalphase phase="1" duration="2" unit="minute">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="2" unit="minute">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="2" unit="minute">
      <users arrivalrate="3" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="2" unit="minute">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="2" unit="minute">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="6" duration="5" unit="minute">
      <users arrivalrate="7" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="7" duration="60" unit="minute">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>

    <session name="ensureproject" probability="0" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"></http>
      </request>

      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url="/login" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                            {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                            edoc_lib:escape_uri(Val)
                                          end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <request subst="true">
        <http url="/login" version="1.1" method="POST" contents="username=admin&amp;password=admin&amp;authenticity_token=%%_escaped_authenticity_token%%"></http>
      </request>

      <request>
        <http url="/projects" version="1.1" method="GET"></http>
      </request>

      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url="/projects/new" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                            {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                            edoc_lib:escape_uri(Val)
                                          end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <!-- <setdynvars sourcetype="erlang" callback="ts_user_server:get_really_unique_id"> -->
      <!--   <var name="project_id" /> -->
      <!-- </setdynvars> -->

      <setdynvars sourcetype="eval" code='fun({Pid, DynVars}) -> "testproject" end.'>
        <var name="project_id" />
      </setdynvars>

      <request subst="true">
        <http url="/projects" version="1.1" method="POST" contents="project[name]=%%_project_id%%&amp;project[identifier]=%%_project_id%%&amp;project[is_public]=1&amp;project[enabled_module_names][]=issue_tracking&amp;project[enabled_module_names][]=time_tracking&amp;project[enabled_module_names][]=news&amp;authenticity_token=%%_escaped_authenticity_token%%"></http>
      </request>

    </session>

    <session name='browse_site' probability='80'  type='ts_http'>
      <setdynvars sourcetype="eval" code='fun({Pid, DynVars}) -> "testproject" end.'>
        <var name="project_id" />
      </setdynvars>

      <!-- wait 10 seconds for our project to be created -->
      <thinktime value='10'/>

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url='/projects/%%_project_id%%' version='1.1' method='GET'></http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url='/projects/%%_project_id%%/issues' version='1.1' method='GET'></http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url='/projects/%%_project_id%%/news' version='1.1' method='GET'></http>
      </request>
    </session>

    <session name='create_issue' probability='20' type='ts_http'>
      <setdynvars sourcetype="eval" code='fun({Pid, DynVars}) -> "testproject" end.'>
        <var name="project_id" />
      </setdynvars>

      <!-- wait 10 seconds for our project to be created -->
      <thinktime value='10'/>

      <request>
        <http url="/" version="1.1" method="GET"></http>
      </request>

      <thinktime random='true' value='5'/>

      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url="/login" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                            {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                            edoc_lib:escape_uri(Val)
                                          end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url="/login" version="1.1" method="POST" contents="username=admin&amp;password=admin&amp;authenticity_token=%%_escaped_authenticity_token%%"></http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <http url='/projects/%%_project_id%%' version='1.1' method='GET'></http>
      </request>

      <thinktime random='true' value='5'/>

      <request subst="true">
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/projects/%%_project_id%%/issues/new' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                            {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                            edoc_lib:escape_uri(Val)
                                          end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <thinktime random='true' value='15'/>

      <setdynvars sourcetype="random_string" length="15">
        <var name="issue_subject" />
      </setdynvars>

      <setdynvars sourcetype="random_string" length="150">
        <var name="issue_description" />
      </setdynvars>

      <request subst="true">
        <http url="/projects/%%_project_id%%/issues/create" version="1.1" method="POST" contents="issue[tracker_id]=1&amp;issue[subject]=%%_issue_subject%%&amp;issue[description]=%%_issue_description%%&amp;issue[status_id]=1&amp;issue[priority_id]=4&amp;commit=Create&amp;authenticity_token=%%_escaped_authenticity_token%%"></http>
      </request>
    </session>

  </sessions>
</tsung>